"""
Задача 2: Найдите сумму цифр трехзначного числа.
*Пример:*
123 -> 6 (1 + 2 + 3)
100 -> 1 (1 + 0 + 0) |
"""

num = int(input("Введите трехзначное число: "))
summ = 0

while num > 0:

    n = num % 10
    summ += n
    num = num // 10

print(f"Сумма равна {summ}")